zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_mdma.h
/**
  ******************************************************************************
  * @file    stm32mp1xx_hal_mdma.h
  * @author  MCD Application Team
  * @version V0.3.0
  * @date    9-December-2016
  * @brief   Header file of DMA HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP1xx_HAL_MDMA_H
#define __STM32MP1xx_HAL_MDMA_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_hal_def.h"

/** @addtogroup STM32MP1xx_HAL_Driver
  * @{
  */

/** @addtogroup MDMA
  * @{
  */ 

/* Exported types ------------------------------------------------------------*/

/** @defgroup MDMA_Exported_Types MDMA Exported Types
  * @brief    MDMA Exported Types 
  * @{
  */

/** 
  * @brief  MDMA Configuration Structure definition
  */
typedef struct
{
  
  uint32_t Request;                 /*!< Specifies the MDMA request.
                                        This parameter can be a value of @ref MDMA_Request_selection*/
                                     
  uint32_t TransferTriggerMode;     /*!< Specifies the Trigger Transfer mode : each request triggers a :
                                         a buffer transfer, a block transfer, a repeated block transfer or a linked list transfer 
                                         This parameter can be a value of @ref MDMA_Transfer_TriggerMode  */  
                                     
  uint32_t Priority;                 /*!< Specifies the software priority for the MDMAy channelx.
                                         This parameter can be a value of @ref MDMA_Priority_level */

 uint32_t SecureMode;            /*!< Specifies if the MDMA master transactions are done in secure mode.
                                      This parameter can be a value of @ref MDMA_Secure_Mode */
                                          
  uint32_t Endianess;                /*!< Specifies if the MDMA transactions preserve the Little endianess.
                                         This parameter can be a value of @ref MDMA_Endianess */ 
                                     
  uint32_t SourceInc;                /*!< Specifies if the Source increment mode .
                                         This parameter can be a value of @ref MDMA_Source_increment_mode */
                                     
  uint32_t DestinationInc;           /*!< Specifies if the Destination increment mode .
                                         This parameter can be a value of @ref MDMA_Destination_increment_mode */
                                     
  uint32_t SourceDataSize;           /*!< Specifies the source data size.
                                         This parameter can be a value of @ref MDMA_Source_data_size */
                                     
  uint32_t DestDataSize;             /*!< Specifies the destination data size.
                                          This parameter can be a value of @ref MDMA_Destination_data_size */
                                       
 
  uint32_t DataAlignment;            /*!< Specifies the source to destination Memory data packing/padding mode.
                                            This parameter can be a value of @ref MDMA_data_Alignment */                                     

  uint32_t BufferTransferLength;      /*!< Specifies the buffer Transfer Length (number of bytes),
                                          this is the number of bytes to be transferred in a single transfer (1 byte to 128 bytes)*/
  
  uint32_t SourceBurst;              /*!< Specifies the Burst transfer configuration for the source memory transfers. 
                                         It specifies the amount of data to be transferred in a single non interruptable 
                                         transaction.
                                         This parameter can be a value of @ref MDMA_Source_burst 
                                         @note : the burst may be FIXED/INCR based on SourceInc value ,
                                         the BURST must be programmed as to ensure that the burst size will be lower than than
                                         BufferTransferLength */
                                    
  uint32_t DestBurst;                 /*!< Specifies the Burst transfer configuration for the destination memory transfers. 
                                           It specifies the amount of data to be transferred in a single non interruptable 
                                           transaction.
                                           This parameter can be a value of @ref MDMA_Destination_burst 
                                           @note : the burst may be FIXED/INCR based on DestinationInc value ,
                                           the BURST must be programmed as to ensure that the burst size will be lower than than
                                           BufferTransferLength */
                                     
  int32_t SourceBlockAddressOffset;   /*!< this field specifies the Next block source address offset
                                           signed value : if > 0 then  increment the next block source Address by offset from where the last block ends
                                                          if < 0 then  decrement the next block source Address by offset from where the last block ends
                                                          if == 0, the next block source address starts from where the last block ends
                                       */                                                                            


  int32_t DestBlockAddressOffset;      /*!< this field specifies the Next block destination address offset
                                           signed value : if > 0 then  increment the next block destination Address by offset from where the last block ends
                                                          if < 0 then  decrement the next block destination Address by offset from where the last block ends
                                                          if == 0, the next block destination address starts from where the last block ends
                                       */  
  
}MDMA_InitTypeDef;

/** 
  * @brief  HAL MDMA linked list node structure definition  
  * @note   The Linked list node allows to define a new MDMA configuration 
  *         (CTCR ,CBNDTR ,CSAR ,CDAR ,CBRUR, CLAR, CTBR, CMAR and CMDR registers).
  *         When CLAR register is configured to a non NULL value , each time a transfer ends,
  *         a new configuration (linked list node) is automatically loaded from the address given in CLAR register.            
  */
typedef struct
{
  uint32_t CTCR;    /*!< New CTCR register configuration for the given MDMA linked list node   */
  uint32_t CBNDTR;  /*!< New CBNDTR register configuration for the given MDMA linked list node */
  uint32_t CSAR;    /*!< New CSAR register configuration for the given MDMA linked list node   */
  uint32_t CDAR;    /*!< New CDAR register configuration for the given MDMA linked list node   */
  uint32_t CBRUR;   /*!< New CBRUR register configuration for the given MDMA linked list node  */
  uint32_t CLAR;    /*!< New CLAR register configuration for the given MDMA linked list node   */
  uint32_t CTBR;    /*!< New CTBR register configuration for the given MDMA linked list node   */
  uint32_t CMAR;    /*!< New CMAR register configuration for the given MDMA linked list node   */
  uint32_t CMDR;    /*!< New CMDR register configuration for the given MDMA linked list node   */  
  
}MDMA_LinkNodeTypeDef;

/** 
  * @brief  HAL MDMA linked list node configuration structure definition  
  * @note   used with HAL_MDMA_LinkedList_CreateNode function 
  */
typedef struct
{ 
  MDMA_InitTypeDef Init;            /* !< configuration of the specified MDMA Linked List Node    */
  uint32_t         SrcAddress;      /* !< The source memory address for the Linked list Node      */
  uint32_t         DstAddress;      /* !< The destination memory address for the Linked list Node */
  uint32_t         BlockDataLength; /* !< The length of a block transfer in bytes                 */
  uint32_t         BlockCount;      /* !< The number of a blocks to be transfer                   */

  uint32_t PostRequestMaskAddress;  /*!< specifies the address to be updated (written) with PostRequestMaskData after a request is served.
                                         PostRequestMaskAddress and PostRequestMaskData could be used to automatically clear a peripheral flag when the request is served  */

  uint32_t PostRequestMaskData;     /*!< specifies the value to be written to PostRequestMaskAddress after a request is served.
                                         PostRequestMaskAddress and PostRequestMaskData could be used to automatically clear a peripheral flag when the request is served  */
  
  
}MDMA_LinkNodeConfTypeDef;


/** 
  * @brief  HAL MDMA State structure definition
  */
typedef enum
{
  HAL_MDMA_STATE_RESET               = 0x00U,  /*!< MDMA not yet initialized or disabled */
  HAL_MDMA_STATE_READY               = 0x01U,  /*!< MDMA initialized and ready for use   */
  HAL_MDMA_STATE_BUSY                = 0x02U,  /*!< MDMA process is ongoing              */
  HAL_MDMA_STATE_TIMEOUT             = 0x03U,  /*!< MDMA timeout state                   */
  HAL_MDMA_STATE_ERROR               = 0x04U,  /*!< MDMA error state                     */
  HAL_MDMA_STATE_ABORT               = 0x05U,  /*!< DMA Abort state                      */

